<template>
  <div class="video-bg">
    <video width="320" height="240" autoplay loop muted>
      <source
        src="/public/7btrrd_2.mp4"
        type="video/mp4"
      />
      Your browser does not support the video tag.
    </video>
  </div>
  <div class="app">
    <div class="wrapper">
      <div class="left-side">
        <div class="side-wrapper">
          <div class="side-title">Apps</div>
          <div class="side-menu">
            <router-link to="/background/person">
              <a  >
                <svg viewBox="0 0 512 512">
                  <g xmlns="http://www.w3.org/2000/svg" fill="currentColor">
                    <path
                      d="M0 0h128v128H0zm0 0M192 0h128v128H192zm0 0M384 0h128v128H384zm0 0M0 192h128v128H0zm0 0"
                      data-original="#bfc9d1"
                    />
                  </g>
                  <path
                    xmlns="http://www.w3.org/2000/svg"
                    d="M192 192h128v128H192zm0 0"
                    fill="currentColor"
                    data-original="#82b1ff"
                  />
                  <path
                    xmlns="http://www.w3.org/2000/svg"
                    d="M384 192h128v128H384zm0 0M0 384h128v128H0zm0 0M192 384h128v128H192zm0 0M384 384h128v128H384zm0 0"
                    fill="currentColor"
                    data-original="#bfc9d1"
                  />
                </svg>
                人员
              </a>
            </router-link>
          </div>
        </div>
        <div class="side-wrapper">
          <div class="side-title">控制</div>
          <div class="side-menu">
            <router-link to="/background/distribute">
            <a  >
              <svg viewBox="0 0 512 512" fill="currentColor">
                <path
                  d="M497 151H316c-8.401 0-15 6.599-15 15v300c0 8.401 6.599 15 15 15h181c8.401 0 15-6.599 15-15V166c0-8.401-6.599-15-15-15zm-76 270h-30c-8.401 0-15-6.599-15-15s6.599-15 15-15h30c8.401 0 15 6.599 15 15s-6.599 15-15 15zm0-180h-30c-8.401 0-15-6.599-15-15s6.599-15 15-15h30c8.401 0 15 6.599 15 15s-6.599 15-15 15z"
                />
                <path
                  d="M15 331h196v60h-75c-8.291 0-15 6.709-15 15s6.709 15 15 15h135v-30h-30v-60h30V166c0-24.814 20.186-45 45-45h135V46c0-8.284-6.716-15-15-15H15C6.716 31 0 37.716 0 46v270c0 8.284 6.716 15 15 15z"
                />
              </svg>
              作业下发
            </a>
          </router-link>
          <router-link to="/background/collect">
            <a  >
              <svg viewBox="0 0 512 512" fill="currentColor">
                <path
                  d="M0 331v112.295a14.996 14.996 0 007.559 13.023L106 512V391L0 331zM136 391v121l105-60V331zM271 331v121l105 60V391zM406 391v121l98.441-55.682A14.995 14.995 0 00512 443.296V331l-106 60zM391 241l-115.754 57.876L391 365.026l116.754-66.15zM262.709 1.583a15.006 15.006 0 00-13.418 0L140.246 57.876 256 124.026l115.754-66.151L262.709 1.583zM136 90v124.955l105 52.5V150zM121 241L4.246 298.876 121 365.026l115.754-66.15zM271 150v117.455l105-52.5V90z"
                />
              </svg>
              作业收取
            </a>
          </router-link>
          <router-link to="/background/Completion">
            <a  >
              <svg viewBox="0 0 512 512" fill="currentColor">
                <path
                  d="M0 331v112.295a14.996 14.996 0 007.559 13.023L106 512V391L0 331zM136 391v121l105-60V331zM271 331v121l105 60V391zM406 391v121l98.441-55.682A14.995 14.995 0 00512 443.296V331l-106 60zM391 241l-115.754 57.876L391 365.026l116.754-66.15zM262.709 1.583a15.006 15.006 0 00-13.418 0L140.246 57.876 256 124.026l115.754-66.151L262.709 1.583zM136 90v124.955l105 52.5V150zM121 241L4.246 298.876 121 365.026l115.754-66.15zM271 150v117.455l105-52.5V90z"
                />
              </svg>
              完成度查看
            </a>
          </router-link>
          </div>
        </div>
        <div class="side-wrapper">
          <div class="side-title">超级管理员选项</div>
          <div class="side-menu">
            <router-link to="/background/password">
            <a  >
              <svg viewBox="0 0 512 512" fill="currentColor">
                <path
                  d="M467 0H45C20.186 0 0 20.186 0 45v422c0 24.814 20.186 45 45 45h422c24.814 0 45-20.186 45-45V45c0-24.814-20.186-45-45-45zM181 241c41.353 0 75 33.647 75 75s-33.647 75-75 75-75-33.647-75-75c0-8.291 6.709-15 15-15s15 6.709 15 15c0 24.814 20.186 45 45 45s45-20.186 45-45-20.186-45-45-45c-41.353 0-75-33.647-75-75s33.647-75 75-75 75 33.647 75 75c0 8.291-6.709 15-15 15s-15-6.709-15-15c0-24.814-20.186-45-45-45s-45 20.186-45 45 20.186 45 45 45zm180 120h30c8.291 0 15 6.709 15 15s-6.709 15-15 15h-30c-24.814 0-45-20.186-45-45V211h-15c-8.291 0-15-6.709-15-15s6.709-15 15-15h15v-45c0-8.291 6.709-15 15-15s15 6.709 15 15v45h45c8.291 0 15 6.709 15 15s-6.709 15-15 15h-45v135c0 8.276 6.724 15 15 15z"
                />
              </svg>
              密码修改
            </a>
          </router-link>
          <router-link to="/background/class">
            <a  >
              <svg
                t="1693272990421"
                class="icon"
                viewBox="0 0 1024 1024"
                version="1.1"
                xmlns="http://www.w3.org/2000/svg"
                p-id="3206"
                width="17"
                height="17"
              >
                <path
                  d="M597.12 528.192c-106.176 0-192.512-86.336-192.512-192.512s86.4-192.512 192.512-192.512 192.512 86.336 192.512 192.512-86.4 192.512-192.512 192.512z m0-337.024C517.44 191.168 452.608 256 452.608 335.68S517.44 480.192 597.12 480.192s144.512-64.832 144.512-144.512-64.832-144.512-144.512-144.512z"
                  p-id="3207"
                  fill="#ffffff"
                ></path>
                <path
                  d="M264 880.64a24 24 0 0 1-24-24 375.808 375.808 0 0 1 375.424-375.296 24 24 0 0 1 0 48A327.68 327.68 0 0 0 288 856.64a23.936 23.936 0 0 1-24 24zM345.344 504.832c-89.472 0-151.936-69.504-151.936-169.152a169.344 169.344 0 0 1 169.152-169.152 24 24 0 0 1 0 48.064 121.28 121.28 0 0 0-121.152 121.152c0 60.288 32.128 121.152 103.936 121.152a24 24 0 0 1 0 47.936z"
                  p-id="3208"
                  fill="#ffffff"
                ></path>
                <path
                  d="M85.376 766.976a24 24 0 0 1-24-24c0-165.824 123.968-286.208 294.72-286.208a24 24 0 0 1 0 48.064c-145.28 0-246.72 97.92-246.72 238.208a24 24 0 0 1-24 23.936zM938.688 880.768a24.064 24.064 0 0 1-23.936-22.208 325.568 325.568 0 0 0-206.144-280.064 23.936 23.936 0 1 1 17.6-44.544 373.056 373.056 0 0 1 236.352 321.024 24 24 0 0 1-22.144 25.728l-1.728 0.064z"
                  p-id="3209"
                  fill="#ffffff"
                ></path>
              </svg>
              班级管理
            </a>
          </router-link>
          <router-link to="/background/personmag">
            <a  >
              <svg
                t="1693273144520"
                class="icon"
                viewBox="0 0 1024 1024"
                version="1.1"
                xmlns="http://www.w3.org/2000/svg"
                p-id="3411"
                width="16"
                height="16"
              >
                <path
                  d="M134.853824 843.379541a26.653981 26.653981 0 0 1-20.71944-9.83373 510.199055 510.199055 0 0 1-42.353645-59.677018 26.95128 26.95128 0 1 1 45.978404-28.129041 446.805802 446.805802 0 0 0 37.905598 53.399439 27.237144 27.237144 0 0 1-3.533282 38.088551 27.866046 27.866046 0 0 1-17.300504 6.174668z m0 0"
                  p-id="3412"
                  fill="#ffffff"
                ></path>
                <path
                  d="M511.874449 1023.977131a504.481771 504.481771 0 0 1-293.662613-93.546213 27.065626 27.065626 0 0 1-6.483401-37.642603 26.779762 26.779762 0 0 1 37.448215-6.517704 451.50541 451.50541 0 0 0 262.697799 83.598137c251.308968 0 455.850547-205.502083 455.850547-458.01168S763.183417 53.868257 511.874449 53.868257 56.138248 259.484685 56.138248 512.017152a458.423325 458.423325 0 0 0 18.295311 128.764687 26.931841 26.931841 0 1 1-51.672819 15.207977A515.458957 515.458957 0 0 1 2.407206 512.017152C2.407206 229.640459 230.961381 0 512.011664 0s509.547285 229.640459 509.547285 512.017152-228.691389 511.982848-509.6845 511.982848z m0 0"
                  p-id="3413"
                  fill="#ffffff"
                ></path>
                <path
                  d="M796.801051 625.150782H629.044482a16.843121 16.843121 0 0 0 0 33.674807h167.756569a16.843121 16.843121 0 0 0 0-33.674807z m0-134.92792H629.044482a16.843121 16.843121 0 0 0 0 33.674808h167.756569a16.843121 16.843121 0 0 0 0-33.674808z m16.763079-117.959018a16.763079 16.763079 0 0 0-16.763079-16.843121H595.484021a16.843121 16.843121 0 0 0 0 33.686242h201.31703a16.808817 16.808817 0 0 0 16.763079-16.843121zM510.742427 496.191708c21.439818-29.123848 34.303708-66.446283 34.303708-107.107613 0-93.065961-67.566871-168.545554-150.936317-168.545554s-150.936317 75.468159-150.936317 168.545554c0 40.661329 12.909629 77.983764 34.303708 107.107613a100.749992 100.749992 0 0 0-67.955646 95.204225v67.46396c0 55.835003 45.075073 101.115898 100.624211 101.115898h167.745135c55.572008 0 100.624211-45.280895 100.624211-101.115898v-67.46396c0.148649-44.228915-28.392036-81.471307-67.795562-95.204225z m-234.054203-107.027571c0-74.484786 52.59902-134.870747 117.478767-134.870746s117.398725 60.385961 117.398725 134.927919-52.541847 134.92792-117.467333 134.92792-117.410159-60.568914-117.410159-134.985093zM545.091873 650.375442c0 41.873393-36.842183 75.856934-82.3289 75.856934h-137.214834c-45.521021 0-82.3289-33.98354-82.3289-75.856934v-50.563666c0-35.801637 27.019888-65.691602 63.336081-73.650062 24.767277 19.724632 54.965975 31.47937 87.657409 31.47937s62.890132-11.754737 87.645975-31.47937c36.247585 8.004199 63.347515 37.734079 63.347515 73.650062z m0 0"
                  p-id="3414"
                  fill="#ffffff"
                ></path>
                <path
                  d="M134.853824 843.379541a26.653981 26.653981 0 0 1-20.71944-9.83373 510.199055 510.199055 0 0 1-42.353645-59.677018 26.95128 26.95128 0 1 1 45.978404-28.129041 446.805802 446.805802 0 0 0 37.905598 53.399439 27.237144 27.237144 0 0 1-3.533282 38.088551 27.866046 27.866046 0 0 1-17.300504 6.174668z m0 0"
                  p-id="3415"
                  fill="#ffffff"
                ></path>
                <path
                  d="M511.874449 1023.977131a504.481771 504.481771 0 0 1-293.662613-93.546213 27.065626 27.065626 0 0 1-6.483401-37.642603 26.779762 26.779762 0 0 1 37.448215-6.517704 451.50541 451.50541 0 0 0 262.697799 83.598137c251.308968 0 455.850547-205.502083 455.850547-458.01168S763.183417 53.868257 511.874449 53.868257 56.138248 259.484685 56.138248 512.017152a458.423325 458.423325 0 0 0 18.295311 128.764687 26.931841 26.931841 0 1 1-51.672819 15.207977A515.458957 515.458957 0 0 1 2.407206 512.017152C2.407206 229.640459 230.961381 0 512.011664 0s509.547285 229.640459 509.547285 512.017152-228.691389 511.982848-509.6845 511.982848z m0 0"
                  p-id="3416"
                  fill="#ffffff"
                ></path>
                <path
                  d="M806.65765 629.793217H633.09232a17.426284 17.426284 0 0 0 0 34.852568h173.56533a17.426284 17.426284 0 0 0 0-34.852568z m0-139.501747H633.09232a17.426284 17.426284 0 0 0 0 34.852568h173.56533a17.426284 17.426284 0 0 0 0-34.852568z m17.334807-122.029726a17.346242 17.346242 0 0 0-17.334807-17.472022H598.331229a17.426284 17.426284 0 0 0 0 34.852568h208.326421a17.39198 17.39198 0 0 0 17.334807-17.426284z m-313.307203 128.158655c22.183065-30.141525 35.538642-68.744632 35.538642-110.812413 0-96.29051-69.910958-174.377184-156.219088-174.377184s-156.219088 78.086675-156.219089 174.377184c0 42.067781 13.355577 80.670888 35.538642 110.812413a104.226101 104.226101 0 0 0-70.299733 98.485947v69.750874c0 57.75601 46.641609 104.603442 104.12319 104.603441H476.713148c57.493015 0 104.12319-46.881735 104.12319-104.603441v-69.750874c0.160084-45.738278-29.363974-84.284212-70.13965-98.485947z m-242.127009-110.766674c0-77.068998 54.359943-139.501748 121.538039-139.501748s121.457997 62.467053 121.457997 139.501748-54.359943 139.501748-121.538039 139.501747-121.457997-62.53566-121.457997-139.501747zM546.23533 655.932643c0 43.314149-38.122855 78.47545-85.221846 78.475451H319.019c-47.098992 0-85.221846-35.161301-85.221846-78.475451v-52.347459c0-37.048005 27.957522-67.967081 65.531518-76.199971 25.62487 20.399272 56.864114 32.565654 90.68757 32.565654s65.0627-12.166382 90.687571-32.565654c37.493953 8.23289 65.531518 39.083358 65.531517 76.199971z m0 0"
                  p-id="3417"
                  fill="#ffffff"
                ></path>
              </svg>
              人员管理
            </a>
          </router-link>
          </div>
        </div>
      </div>
      <div class="main-container">
        <div class="main-header">
          <div class="rigthbox">
            <svg
              t="1693222972691"
              class="icon"
              viewBox="0 0 1024 1024"
              version="1.1"
              xmlns="http://www.w3.org/2000/svg"
              p-id="3658"
              width="50"
              height="50"
            >
              <path
                d="M512 74.666667c241.536 0 437.333333 195.797333 437.333333 437.333333S753.536 949.333333 512 949.333333 74.666667 753.536 74.666667 512 270.464 74.666667 512 74.666667z m0 64C305.813333 138.666667 138.666667 305.813333 138.666667 512S305.813333 885.333333 512 885.333333 885.333333 718.186667 885.333333 512 718.186667 138.666667 512 138.666667z m138.666667 170.666666a32 32 0 0 1 31.850666 28.928L682.666667 341.333333v106.666667a32 32 0 0 1-63.850667 3.072L618.666667 448v-106.666667a32 32 0 0 1 32-32z m-277.333334 0a32 32 0 0 1 31.850667 28.928L405.333333 341.333333v106.666667a32 32 0 0 1-63.850666 3.072L341.333333 448v-106.666667a32 32 0 0 1 32-32z"
                fill="#ffffff"
                p-id="3659"
              ></path>
            </svg>
            <a>个人中心</a>
          </div>
        </div>
        <div>
          <router-view></router-view>
        </div>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts"></script>

<style scoped lang="scss">
@import url("https://fonts.googleapis.com/css2?family=Poppins:wght@200;300;400;500;600;700&display=swap");

* {
  outline: none;
  box-sizing: border-box;
}

:root {
  --content-bg: rgb(146 151 179 / 13%);
  --button-inactive: rgb(249 250 251 / 55%);
  --dropdown-bg: #21242d;
  --dropdown-hover: rgb(42 46 60);
  --popup-bg: rgb(22 25 37);
  --search-bg: #14162b;
  --overlay-bg: rgba(36, 39, 59, 0.3);
  --scrollbar-bg: rgb(1 2 3 / 40%);
}

.light-mode {
  --theme-bg-color: rgb(255 255 255 / 31%);
  --theme-color: #3c3a3a;
  --inactive-color: #333333;
  --button-inactive: #3c3a3a;
  --search-bg: rgb(255 255 255 / 31%);
  --dropdown-bg: #f7f7f7;
  --overlay-bg: rgb(255 255 255 / 30%);
  --dropdown-hover: rgb(236 236 236);
  --border-color: rgb(255 255 255 / 35%);
  --popup-bg: rgb(255 255 255);
  --hover-menu-bg: rgba(255 255 255 / 35%);
  --scrollbar-bg: rgb(255 253 253 / 57%);
  --content-title-color: --theme-color;
}

html {
  box-sizing: border-box;
  -webkit-font-smoothing: antialiased;
}

body {
  font-family: "Poppins", sans-serif;
  background-image: url(https://wallpapershome.com/images/wallpapers/macos-big-sur-1280x720-dark-wwdc-2020-22655.jpg);
  background-size: cover;
  background-position: center;
  display: flex;
  justify-content: center;
  align-items: center;
  flex-direction: column;
  padding: 2em;
  width: 100%;
  height: 100vh;
  @media screen and (max-width: 480px) {
    padding: 0.8em;
  }
}

.video-bg {
  position: fixed;
  right: 0;
  top: 0;
  width: 100%;
  height: 100%;

  video {
    width: 100%;
    height: 100%;
    object-fit: cover;
  }
}

img {
  max-width: 100%;
}

body.light-mode .video-bg:before {
  content: "";
  position: absolute;
  left: 0;
  top: 0;
  width: 100%;
  height: 100vh;
  background: linear-gradient(
    180deg,
    rgba(255, 255, 255, 0.72) 0%,
    rgb(255 255 255 / 45%) 100%
  );
  backdrop-filter: saturate(3);
}

.app {
  background-color: rgba(16 18 27 / 40%);
  height: 90vh;
  display: flex;
  flex-direction: column;
  overflow: hidden;
  position: relative;
  width: 100%;
  height: 100%;
  border-radius: 14px;
  backdrop-filter: blur(20px);
  -webkit-backdrop-filter: blur(20px);
  font-size: 15px;
  font-weight: 500;
}

.wrapper {
  display: flex;
  flex-grow: 1;
  overflow: hidden;
  height: 100vh;
}

.left-side {
  flex-basis: 240px;
  border-right: 1px solid rgba(113 119 144 / 25%);
  padding: 26px;
  overflow: auto;
  flex-shrink: 0;
  @media screen and (max-width: 945px) {
    display: none;
  }
}

.side-wrapper + .side-wrapper {
  margin-top: 20px;
}

.side-title {
  color: rgb(113 119 144 / 78%);
  margin-bottom: 14px;
}

.side-menu {
  display: flex;
  flex-direction: column;
  white-space: nowrap;
  a {
    text-decoration: none;
    color: #f9fafb;
    display: flex;
    align-items: center;
    font-weight: 400;
    padding: 10px;
    font-size: 14px;
    border-radius: 6px;
    transition: 0.3s;
    &:hover {
      background-color: rgba(12 15 25 / 30%);
    }
  }
  svg {
    width: 16px;
    margin-right: 8px;
  }
}

.updates {
  position: relative;
  top: 0;
  right: 0;
  margin-left: auto;
  width: 18px;
  height: 18px;
  font-size: 11px;
}

.main-header {
  display: flex;
  align-items: center;
  border-bottom: 1px solid rgba(113 119 144 / 25%);
  height: 58px;
  flex-shrink: 0;
  justify-content: right;
  .rigthbox {
    display: flex;
    a {
      font-family: "Open Sans", sans-serif;
      font-size: 20px;
      color: white;
      text-align: center;
      line-height: 50px;
    }
    cursor: pointer;
  }
  .rigthbox:hover {
    background-color: rgba(12 15 25 / 30%);
  }
}

.main-container {
  display: flex;
  flex-direction: column;
  flex-grow: 1;
}

.menu-link-main {
  text-decoration: none;
  color: #f9fafb;
  padding: 0 30px;
  @media screen and (max-width: 1055px) {
    display: none;
  }
}
::-webkit-scrollbar {
  width: 6px;
  border-radius: 10px;
}

::-webkit-scrollbar-thumb {
  background: var(--scrollbar-bg);
  border-radius: 10px;
}
</style>
